
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Сообщение = "Поменялось количество";
	
	ПересчитатьСуммуВСтроке(ТекущиеДанные, Сообщение);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Сообщение = "Поменялась цена";
	
	ПересчитатьСуммуВСтроке(ТекущиеДанные, Сообщение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПересчитатьСуммуВСтроке(Строка, ТекстСообщения)
	
	Строка.Сумма = Строка.Цена * Строка.Количество;
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
	
	Пользователь = ОписаниеПользователя();
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = Пользователь.Имя;
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Функция ОписаниеПользователя()
	
	Описание = Новый Структура;
	Описание.Вставить("Имя", "Антон");
	Описание.Вставить("Стаж", "15");
	Описание.Вставить("ДатаРегистрации", ТекущаяДата());
	Описание.Вставить("ВШтате", Истина);
	
	Возврат Описание;
КонецФункции

#КонецОбласти
